# Задание 3

n = int(input("Введите число n: "))
nn = n * 10 + n
nnn = n * 100 + nn
sum_n = n + nn + nnn
print(f"Сумма чисел {n} + {nn} + {nnn} равна: {sum_n}!")

